# Getting Started with Pandas 
Pandas contains data structures and data manipulation tools designed to make data cleaning
and analysis fast and easy in Python. pandas is often used in tandem with numerical
computing tools like NumPy and SciPy, analytical libraries like statsmodels and
scikit-learn, and data visualization libraries like matplotlib. pandas adopts significant
parts of NumPy’s idiomatic style of array-based computing, especially array-based
functions and a preference for data processing without for loops.

While pandas adopts many coding idioms from NumPy, the biggest difference is that
pandas is designed for working with tabular or heterogeneous data. NumPy, by contrast,
is best suited for working with homogeneous numerical array data.

In [1]:
from pandas import Series, DataFrame  #Series and DataFrame are used so much so import them into the local namespace
import pandas as pd
import numpy as np

## Introduction to pandas Data Structures

To get started with pandas, you will need to get comfortable with its two workhorse
data structures: `Series` and `DataFrame`. While they are not a universal solution for
every problem, they provide a solid, easy-to-use basis for most applications.

### Series

A Series is a one-dimensional array-like object containing an array of data and an associated array of data labels, called its index.

In [2]:
obj=Series([4,7,-5,3])

In [3]:
obj #a default one consisting of intergers 0 through N-1 is created.

0    4
1    7
2   -5
3    3
dtype: int64

The string representation of a Series displayed interactively shows the index on the
left and the values on the right. <font color=red>Since we did not specify an index for the data, a
default one consisting of the integers 0 through $N - 1$ (where N is the length of the
data) is created.</font>

##### Get the array representation and index object of the Series via its values and index attributes.

In [4]:
obj.values

array([ 4,  7, -5,  3])

In [5]:
obj.index

RangeIndex(start=0, stop=4, step=1)

Create a Series with an index identifying each data point

In [6]:
obj2=Series([4,7,-5,3], index=['d','b','a','c'])

In [7]:
obj2

d    4
b    7
a   -5
c    3
dtype: int64

##### Use values in the index when selecting single values or a set of values

In [8]:
obj2['a']

-5

In [9]:
obj2['d']

4

In [10]:
obj2['d']=6

In [11]:
obj2

d    6
b    7
a   -5
c    3
dtype: int64

In [12]:
obj2[['c','a','d']]

c    3
a   -5
d    6
dtype: int64

In [13]:
obj2[obj2>0] # filtering with a boolean array

d    6
b    7
c    3
dtype: int64

In [14]:
#scalar multiplication
obj2*2

d    12
b    14
a   -10
c     6
dtype: int64

In [15]:
#Applying math functions
np.exp(obj2)

d     403.428793
b    1096.633158
a       0.006738
c      20.085537
dtype: float64

Thinking Series as a fixed-length, ordered dictionary, as it is a mapping
of index values to data values.

In [16]:
'b' in obj2

True

In [17]:
'e' in obj2

False

##### Creating a Series by a dictionary

In [18]:
sdata={'Ohio':35000, 'Texas':71000,'Oregon':16000, 'Utah':5000}

In [19]:
#Creating Series by function Series
obj3=Series(sdata)

In [20]:
obj3

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

When you are only passing a dict, the index in the resulting Series will have the dict’s
keys in sorted order. You can override this by passing the dict keys in the order you
want them to appear in the resulting Series:

In [21]:
states=['California','Ohio','Oregon','Texas']

In [22]:
# The 3 same values found in sdata were placed in the appropriate location, but since no value for 'California' was found,
# it appears as NaN
obj4=Series(sdata, index=states) #按照index 顺序进行匹配

In [23]:
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

##### Using isnull and notnull functions in pandas to detect missing data

In [24]:
pd.isnull(obj4)

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

<font color=red> A useful tool to help count how many missing values in the data is the calling `Series` or `dataframe`.isna().sum()</font>

In [25]:
obj4.isna().sum()

1

In [26]:
pd.notnull(obj4)

California    False
Ohio           True
Oregon         True
Texas          True
dtype: bool

In [27]:
pd.isna(obj4)

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [28]:
obj4.isnull()

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

##### A critical Series feature for many applications is that is automatically aligns differently-indexed data in arithmetic operations

In [29]:
obj3+obj4 #注意California and Utah

California         NaN
Ohio           70000.0
Oregon         32000.0
Texas         142000.0
Utah               NaN
dtype: float64

Both Series object itself and its index have a "name" attribute, which integrates with other key areas of pandas functionality

In [30]:
obj4.name='population'

In [31]:
obj4.index.name='state'

In [32]:
obj4

state
California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
Name: population, dtype: float64

##### A Series’s index can be altered in-place by assignment:

In [33]:
obj.index=['Bob','Steve','Jeff','Ryan']
obj

Bob      4
Steve    7
Jeff    -5
Ryan     3
dtype: int64

## DataFrame

A DataFrame represents a tabular, spreadsheet-like data structure. <font color=red>DataFrame has both a row and column index.</font> It can be thought of as a dict of Series.

##### Lists in dictionary

In [34]:
data={'state':['Ohio','Ohio','Ohio','Nevada','Nevada'],
     'year':[2000,2001,2002,2001,2002],
     'pop':[1.5,1.7,3.6,2.4,2.9]}

All the keys in the dictionary become column index.

In [35]:
frame=DataFrame(data)

In [36]:
frame

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9

<font color=red>If you specify a sequence of columns, the DataFrame's column will be exactly what you pass.</font> 如果指定了列序列，DataFrame就会按照指定的顺序进行排列

In [37]:
DataFrame(data, columns=['year','state','pop'])

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9

As with Series, if you pass a column that isn't contained in data, it will appear with NA values.

In [38]:
frame2=DataFrame(data, columns=['year','state','pop','debt'],
                index=['one','two','three','four','five'])

In [39]:
frame2

       year   state  pop debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2002  Nevada  2.9  NaN

In [40]:
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

A column in a DataFrame can be retrieved as a Series either by dict-like notation or
by attribute:

In [41]:
frame2['state']

one        Ohio
two        Ohio
three      Ohio
four     Nevada
five     Nevada
Name: state, dtype: object

In [42]:
frame2.year

one      2000
two      2001
three    2002
four     2001
five     2002
Name: year, dtype: int64

The returned Series have the same index as the DataFrame. <font color=red>Rows can also be retrieved by position or name by a couple of methods.</font>

In [43]:
frame2.loc['three']

year     2002
state    Ohio
pop       3.6
debt      NaN
Name: three, dtype: object

<font color=red>Columns can be modified by assignment.</font>

In [44]:
frame2['debt']=16.5

In [45]:
frame2

       year   state  pop  debt
one    2000    Ohio  1.5  16.5
two    2001    Ohio  1.7  16.5
three  2002    Ohio  3.6  16.5
four   2001  Nevada  2.4  16.5
five   2002  Nevada  2.9  16.5

In [46]:
frame2['debt']=np.arange(5)

In [47]:
frame2

       year   state  pop  debt
one    2000    Ohio  1.5     0
two    2001    Ohio  1.7     1
three  2002    Ohio  3.6     2
four   2001  Nevada  2.4     3
five   2002  Nevada  2.9     4

When assigning lists or arrays to a column, the value's length must match the length of the DataFrame. If you assign a Series, it will be instead conforned exactly to the DataFrame's index, inserting missing values.

In [48]:
val=Series([-1.2,-1.5,-1.7], index=['two','four','five'])

In [49]:
frame2['debt']=val

In [50]:
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   NaN
two    2001    Ohio  1.7  -1.2
three  2002    Ohio  3.6   NaN
four   2001  Nevada  2.4  -1.5
five   2002  Nevada  2.9  -1.7

<font color=red>Assigning a column that doesn't exist will create a new column. The del keyword will delete columns as with a dictionary.</font>

In [51]:
frame2['eastern']=frame2.state=='Ohio' #boolean

In [52]:
frame2

       year   state  pop  debt  eastern
one    2000    Ohio  1.5   NaN     True
two    2001    Ohio  1.7  -1.2     True
three  2002    Ohio  3.6   NaN     True
four   2001  Nevada  2.4  -1.5    False
five   2002  Nevada  2.9  -1.7    False

In [53]:
del frame2['eastern']

In [54]:
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   NaN
two    2001    Ohio  1.7  -1.2
three  2002    Ohio  3.6   NaN
four   2001  Nevada  2.4  -1.5
five   2002  Nevada  2.9  -1.7

##### Another common form of data is a nested dict of dicts format.

In [55]:
pop={'Nevada':{2001:2.4,2002:2.9},
    'Ohio':{2000:1.5,2001:1.7,2002:3.6}}

In [56]:
frame3=DataFrame(pop)

In [57]:
frame3
#Outer dict keys as the columns and the inner keys as the row indices

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   1.7
2002     2.9   3.6

Transpose the dataframe

In [58]:
frame3.T

        2000  2001  2002
Nevada   NaN   2.4   2.9
Ohio     1.5   1.7   3.6

If we explicit the index

In [59]:
DataFrame(pop, index=pd.Index(np.arange(2001,2004,1)))

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2003     NaN   NaN

In [60]:
pdata={'Ohio': frame3['Ohio'][:-1],
      'Nevada': frame3['Nevada'][:2]}

In [61]:
DataFrame(pdata)

      Ohio  Nevada
2000   1.5     NaN
2001   1.7     2.4

<font color=red>If a DataFrame's index and columns have their name attributes set, these will also be displayed.</font>

In [62]:
frame3.index.name='year'; frame3.columns.name='state'

In [63]:
frame3

state  Nevada  Ohio
year
2000      NaN   1.5
2001      2.4   1.7
2002      2.9   3.6

Like Series, the values attributes returns the data contained in the DataFrame as 2D ndarray

In [64]:
frame3.values

array([[nan, 1.5],
       [2.4, 1.7],
       [2.9, 3.6]])

If the DataFrame’s columns are different dtypes, the dtype of the values array will be
chosen to accommodate all of the columns:

In [65]:
frame2.values

array([[2000, 'Ohio', 1.5, nan],
       [2001, 'Ohio', 1.7, -1.2],
       [2002, 'Ohio', 3.6, nan],
       [2001, 'Nevada', 2.4, -1.5],
       [2002, 'Nevada', 2.9, -1.7]], dtype=object)

### Index Objects
pandas’s Index objects are responsible for holding the axis labels and other metadata
(like the axis name or names). Any array or other sequence of labels you use when
constructing a Series or DataFrame is internally converted to an Index:

In [66]:
obj=Series(range(3), index=['a','b','c'])

In [67]:
obj

a    0
b    1
c    2
dtype: int64

In [68]:
index=obj.index

In [69]:
index

Index(['a', 'b', 'c'], dtype='object')

In [70]:
index[1:]

Index(['b', 'c'], dtype='object')

In [71]:
index[1]='d' #index objects are immuatble

TypeError: Index does not support mutable operations

In [72]:
index=pd.Index(np.arange(3))

In [73]:
obj2=Series([1.5,-2.5,0], index=index)

In [74]:
obj2

0    1.5
1   -2.5
2    0.0
dtype: float64

In [75]:
obj2.index is index

True

In [76]:
frame3

state  Nevada  Ohio
year
2000      NaN   1.5
2001      2.4   1.7
2002      2.9   3.6

In [77]:
'Ohio' in frame3.columns

True

In [78]:
2003 in frame3.index

False

## Essential Functionality

### Reindexing

<font color=red>Reindex means to create a new object with the data conformed to a new index</font>

In [79]:
obj=Series([4.5,7.2,-5.3,3.6], index=['d','b','a','c'])

In [80]:
obj

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

In [81]:
obj.reindex(['a','b','c','d','e'], fill_value=0)# 用0去填充缺失的值value

a   -5.3
b    7.2
c    3.6
d    4.5
e    0.0
dtype: float64

Calling reindex on this Series rearranges the data according to the new index, introducing missing values if any index values were not already present.

In [82]:
obj2=obj.reindex(['a','b','c','d','e'])

In [83]:
obj2

a   -5.3
b    7.2
c    3.6
d    4.5
e    NaN
dtype: float64

In [84]:
obj3=Series(['blue','purple','yellow'], index=[0,2,4])

In [85]:
obj3

0      blue
2    purple
4    yellow
dtype: object

In [86]:
obj3.reindex(range(6), method='ffill') #前向填充 上一值个来填充下一个值

0      blue
1      blue
2    purple
3    purple
4    yellow
5    yellow
dtype: object

In [87]:
frame=DataFrame(np.arange(9).reshape((3,3)), index=['a','c','d'],
               columns=['Ohio','Texas','California']) #Gives a new shape to an array without changing its data.

In [88]:
frame

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

In [89]:
frame2=frame.reindex(['a','b','c','d'])

In [90]:
frame2

   Ohio  Texas  California
a   0.0    1.0         2.0
b   NaN    NaN         NaN
c   3.0    4.0         5.0
d   6.0    7.0         8.0

<font color=red>The columns can be reindexed using the columns keyword</font>

In [91]:
states=['Texas','Utah','California']

In [92]:
frame.reindex(columns=states)

   Texas  Utah  California
a      1   NaN           2
c      4   NaN           5
d      7   NaN           8

Both can be reindexed in one shot, though interpolation will only apply row-wise.

In [93]:
frame.reindex(index=['a','b','c','d'],
             columns=states).ffill()

   Texas  Utah  California
a    1.0   NaN         2.0
b    1.0   NaN         2.0
c    4.0   NaN         5.0
d    7.0   NaN         8.0

In [94]:
frame.loc[['a','b','c','d'], states]

/Users/dingxuanzhang/anaconda/lib/python3.6/site-packages/ipykernel_launcher.py:1: FutureWarning:
Passing list-likes to .loc or [] with any missing label will raise
KeyError in the future, you can use .reindex() as an alternative.

See the documentation here:
https://pandas.pydata.org/pandas-docs/stable/indexing.html#deprecate-loc-reindex-listlike
  """Entry point for launching an IPython kernel.

   Texas  Utah  California
a    1.0   NaN         2.0
b    NaN   NaN         NaN
c    4.0   NaN         5.0
d    7.0   NaN         8.0

### Dropping entries from an axis

Dropping one or more entries from an axis is easy if you already have an index array
or list without those entries. As that can require a bit of munging and set logic, the
`drop` method will return a new object with the indicated value or values deleted from
an axis:

In [95]:
obj=Series(np.arange(5), index=['a','b','c','d','e'])
obj

a    0
b    1
c    2
d    3
e    4
dtype: int64

##### Series or DataFrame.drop( index)

In [96]:
new_obj=obj.drop('c') #drop row 'c'

In [97]:
new_obj

a    0
b    1
d    3
e    4
dtype: int64

In [98]:
obj.drop(['d','c'])

a    0
b    1
e    4
dtype: int64

With DataFrame, index values can be deleted from either axis:

In [99]:
data=DataFrame(np.arange(16).reshape((4,4)),
              index=['Ohio','Colorado','Utah','New York'],
              columns=['One','Two','Three','Four'])

In [100]:
data

          One  Two  Three  Four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [101]:
data.drop(['Colorado','Ohio'])

          One  Two  Three  Four
Utah        8    9     10    11
New York   12   13     14    15

##### DataFrame.drop(column index, axis=1)

In [102]:
data.drop('Two', axis=1) #default axis is 0

          One  Three  Four
Ohio        0      2     3
Colorado    4      6     7
Utah        8     10    11
New York   12     14    15

In [103]:
data.drop(['Two', 'Four'], axis=1)

          One  Three
Ohio        0      2
Colorado    4      6
Utah        8     10
New York   12     14

Many functions, like drop, which modify the size or shape of a Series or DataFrame,
can manipulate an object in-place without returning a new object:

In [104]:
obj.drop('c', inplace=True)
obj

a    0
b    1
d    3
e    4
dtype: int64

### Indexing, selection and filtering
Series indexing (`obj[...]`) works analogously to NumPy array indexing, except you
can use the Series’s index values instead of only integers. Here are some examples of
this:

In [105]:
obj=Series(np.arange(4), index=['a','b','c','d'])

In [106]:
obj

a    0
b    1
c    2
d    3
dtype: int64

In [107]:
obj['b']

1

In [108]:
obj[1] #Obj 第二项

1

In [109]:
obj[2:4] #第三项 第四项

c    2
d    3
dtype: int64

In [110]:
obj[['b','a','d']] #按照索引顺序 索引

b    1
a    0
d    3
dtype: int64

In [111]:
obj[[1,3]]

b    1
d    3
dtype: int64

In [112]:
obj[obj<2]

a    0
b    1
dtype: int64

<font color=red>Slicing with labels behaves differently than normal Python slicing. End point is inclusive.</font>

In [113]:
obj['b':'c']

b    1
c    2
dtype: int64

In [114]:
obj['b':'c']=5

In [115]:
obj

a    0
b    5
c    5
d    3
dtype: int64

Indexing into a DataFrame is for retrieving one or more columns

In [116]:
data=DataFrame(np.arange(16).reshape((4,4)),
              index=['Ohio','Colorado','Utah','New York'],
              columns=['One','Two','Three','Four'])

In [117]:
data

          One  Two  Three  Four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [118]:
data['Two'] #retrieving one column or say, Series

Ohio         1
Colorado     5
Utah         9
New York    13
Name: Two, dtype: int64

In [119]:
data[['Four','Three']]

          Four  Three
Ohio         3      2
Colorado     7      6
Utah        11     10
New York    15     14

In [120]:
data[:2]#选取前两行

          One  Two  Three  Four
Ohio        0    1      2     3
Colorado    4    5      6     7

In [121]:
data[data['Three']>5]

          One  Two  Three  Four
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [122]:
data<5

            One    Two  Three   Four
Ohio       True   True   True   True
Colorado   True  False  False  False
Utah      False  False  False  False
New York  False  False  False  False

In [123]:
data[data<5]=0

In [124]:
data

          One  Two  Three  Four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

#### Selection with loc and iloc
For DataFrame label-indexing on the rows, I introduce the special indexing operators
`loc` and `iloc`. They enable you to select a subset of the rows and columns from a
DataFrame with NumPy-like notation using either axis labels (`loc`) or integers
(`iloc`).

##### DataFrame.loc[row index] but DataFrame.iloc[row number]

In [125]:
data.loc['Colorado',['Two','Three']]

Two      5
Three    6
Name: Colorado, dtype: int64

In [126]:
data.iloc[[2,3],[3,0,1]]

          Four  One  Two
Utah        11    8    9
New York    15   12   13

In [127]:
data.iloc[2]

One       8
Two       9
Three    10
Four     11
Name: Utah, dtype: int64

<font color=red> End point is inclusive.</font>

In [128]:
data.loc[:'Utah','Two']

Ohio        0
Colorado    5
Utah        9
Name: Two, dtype: int64

In [129]:
data.iloc[:,:3]

          One  Two  Three
Ohio        0    0      0
Colorado    0    5      6
Utah        8    9     10
New York   12   13     14

In [130]:
data.iloc[:,:3][data.Three>5]

          One  Two  Three
Colorado    0    5      6
Utah        8    9     10
New York   12   13     14

#### Integer Indexes
Working with pandas objects indexed by integers is something that often trips up
new users due to some differences with indexing semantics on built-in Python data
structures like lists and tuples. For example, you might not expect the following code
to generate an error:

In [131]:
ser=Series(np.arange(3.))
ser
#ser[-1] gets an error

0    0.0
1    1.0
2    2.0
dtype: float64

In [132]:
ser2=Series(np.arange(3.), index=['a','b','c'])
ser2

a    0.0
b    1.0
c    2.0
dtype: float64

In [133]:
ser2[-1]

2.0

In [134]:
ser[:1]

0    0.0
dtype: float64

In [135]:
ser.loc[:1]

0    0.0
1    1.0
dtype: float64

In [136]:
ser.iloc[:1]

0    0.0
dtype: float64

## Arithmetic and data alignment
An important pandas feature for some applications is the behavior of arithmetic
between objects with different indexes. When you are adding together objects, if any
index pairs are not the same, the respective index in the result will be the union of the
index pairs.

In [137]:
s1=Series([7.3,-2.5,3.4,1.5],index=['a','c','d','e'])

In [138]:
s2=Series([-2.1,3.6,-1.5,4,3.1], index=['a','c','e','f','g'])

In [139]:
s1

a    7.3
c   -2.5
d    3.4
e    1.5
dtype: float64

In [140]:
s2

a   -2.1
c    3.6
e   -1.5
f    4.0
g    3.1
dtype: float64

In [141]:
s1+s2 ## combind them with the same index

a    5.2
c    1.1
d    NaN
e    0.0
f    NaN
g    NaN
dtype: float64

##### Alignment is performed on both the rows and the columns for DataFrames

In [142]:
df1=DataFrame(np.arange(9).reshape((3,3)), columns=list('bcd'),
             index=['Ohio','Texas','Colorado'])

In [143]:
df2=DataFrame(np.arange(12).reshape((4,3)), columns=list('bde'),
             index=['Utah','Ohio','Texas','Oregon'])

In [144]:
df1

          b  c  d
Ohio      0  1  2
Texas     3  4  5
Colorado  6  7  8

In [145]:
df2

        b   d   e
Utah    0   1   2
Ohio    3   4   5
Texas   6   7   8
Oregon  9  10  11

Adding these together returns a DataFrame whose index and columns are united.

In [146]:
df1+df2

            b   c     d   e
Colorado  NaN NaN   NaN NaN
Ohio      3.0 NaN   6.0 NaN
Oregon    NaN NaN   NaN NaN
Texas     9.0 NaN  12.0 NaN
Utah      NaN NaN   NaN NaN

Since the 'c' and 'e' columns are not found in both DataFrame objects, they appear
as all missing in the result. The same holds for the rows whose labels are not common
to both objects.

If you add DataFrame objects with no column or row labels in common, the result
will contain all nulls:

In [147]:
df1=DataFrame({'A':[1,2]})
df1

   A
0  1
1  2

In [148]:
df2=DataFrame({'B':[3,4]})
df2

   B
0  3
1  4

In [149]:
df1+df2

    A   B
0 NaN NaN
1 NaN NaN

In [150]:
df1-df2

    A   B
0 NaN NaN
1 NaN NaN

### Arithmetic methods with fill values
In arithmetic operations between differently indexed objects, you might want to fill
with a special value, like 0, when an axis label is found in one object but not the other:

In [151]:
df1=DataFrame(np.arange(12).reshape((3,4)), columns=list('abcd'))

In [152]:
df2=DataFrame(np.arange(20).reshape((4,5)), columns=list('abcde'))

In [153]:
df1

   a  b   c   d
0  0  1   2   3
1  4  5   6   7
2  8  9  10  11

In [154]:
df2

    a   b   c   d   e
0   0   1   2   3   4
1   5   6   7   8   9
2  10  11  12  13  14
3  15  16  17  18  19

In [155]:
df2.loc[1,'b']=np.nan
df2

    a     b   c   d   e
0   0   1.0   2   3   4
1   5   NaN   7   8   9
2  10  11.0  12  13  14
3  15  16.0  17  18  19

Adding these together results in NA values in the locations that don’t overlap:

In [156]:
df1+df2

      a     b     c     d   e
0   0.0   2.0   4.0   6.0 NaN
1   9.0   NaN  13.0  15.0 NaN
2  18.0  20.0  22.0  24.0 NaN
3   NaN   NaN   NaN   NaN NaN

##### Using the `add` method on df1, I pass `df2` and an argument to `fill_value`:

In [157]:
## df1+df2 避免NAN值 用df1.add() NaN的部分用 df2去填充
df1.add(df2, fill_value=0)

      a     b     c     d     e
0   0.0   2.0   4.0   6.0   4.0
1   9.0   5.0  13.0  15.0   9.0
2  18.0  20.0  22.0  24.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [158]:
1/df1

          a         b         c         d
0       inf  1.000000  0.500000  0.333333
1  0.250000  0.200000  0.166667  0.142857
2  0.125000  0.111111  0.100000  0.090909

In [159]:
df1.rdiv(1)

          a         b         c         d
0       inf  1.000000  0.500000  0.333333
1  0.250000  0.200000  0.166667  0.142857
2  0.125000  0.111111  0.100000  0.090909

Relatedly, when reindexing a Series or DataFrame, you can also specify a different fill
value:

In [160]:
df1.reindex(columns=df2.columns, fill_value=0)

   a  b   c   d  e
0  0  1   2   3  0
1  4  5   6   7  0
2  8  9  10  11  0

### Operations between DataFrame and Series

In [161]:
arr=np.arange(12.).reshape((3,4))

In [162]:
arr

array([[ 0.,  1.,  2.,  3.],
       [ 4.,  5.,  6.,  7.],
       [ 8.,  9., 10., 11.]])

In [163]:
arr[0]

array([0., 1., 2., 3.])

In [164]:
arr-arr[0]

array([[0., 0., 0., 0.],
       [4., 4., 4., 4.],
       [8., 8., 8., 8.]])

When we subtract `arr[0]` from arr, the subtraction is performed once for each row.
This is referred to as <font color=red>broadcasting</font> and is explained in more detail as it relates to general
NumPy arrays in Appendix A.

In [165]:
frame=DataFrame(np.arange(12.).reshape((4,3)), columns=list('bde'),
               index=['Utah','Ohio','Texas','Oregon'])
frame

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [166]:
series=frame.iloc[0]
series

b    0.0
d    1.0
e    2.0
Name: Utah, dtype: float64

By default, arithmetic between DataFrame and Series matches the index of the Series
on the DataFrame’s columns, broadcasting down the rows:

In [167]:
frame-series

          b    d    e
Utah    0.0  0.0  0.0
Ohio    3.0  3.0  3.0
Texas   6.0  6.0  6.0
Oregon  9.0  9.0  9.0

In [168]:
series2=Series(range(3), index=list('bef'))
series2

b    0
e    1
f    2
dtype: int64

In [169]:
frame+series2

          b   d     e   f
Utah    0.0 NaN   3.0 NaN
Ohio    3.0 NaN   6.0 NaN
Texas   6.0 NaN   9.0 NaN
Oregon  9.0 NaN  12.0 NaN

If you want to instead broadcast over the columns, matching on the rows, you have to
use one of the arithmetic methods. For example:

In [170]:
series3=frame['d']

In [171]:
frame

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [172]:
series3

Utah       1.0
Ohio       4.0
Texas      7.0
Oregon    10.0
Name: d, dtype: float64

In [173]:
frame.sub(series3, axis=0) #Subtraction of dataframe and other, element-wise

          b    d    e
Utah   -1.0  0.0  1.0
Ohio   -1.0  0.0  1.0
Texas  -1.0  0.0  1.0
Oregon -1.0  0.0  1.0

## Function application and mapping
Numpy ufuncs work fine with pandas objects

In [174]:
#np.random.randn Return a sample (or samples) from the “standard normal” distribution.
frame=DataFrame(np.random.randn(4,3), columns=list('bde'),
               index=['Utah','Ohio','Texas','Oregon'])
frame

               b         d         e
Utah   -0.580960  0.174880 -2.525324
Ohio    1.355102 -1.759478 -0.905877
Texas   0.262419 -1.565827  0.137794
Oregon  0.687498  1.806119 -0.722967

In [175]:
np.abs(frame) #taking absolute value

               b         d         e
Utah    0.580960  0.174880  2.525324
Ohio    1.355102  1.759478  0.905877
Texas   0.262419  1.565827  0.137794
Oregon  0.687498  1.806119  0.722967

In [176]:
f=lambda x: x.max()-x.min()

In [177]:
frame.apply(f) #默认值 是一行操作

b    1.936062
d    3.565597
e    2.663119
dtype: float64

In [178]:
frame.apply(f, axis=1)

Utah      2.700205
Ohio      3.114581
Texas     1.828246
Oregon    2.529085
dtype: float64

In [179]:
def f(x):
    return Series([x.min(), x.max()], index=['min','max'])

In [180]:
frame.apply(f) #按列选取最大值 最小值

            b         d         e
min -0.580960 -1.759478 -2.525324
max  1.355102  1.806119  0.137794

In [181]:
frame.apply(f, axis=1) #按行选取最大值最小值

             min       max
Utah   -2.525324  0.174880
Ohio   -1.759478  1.355102
Texas  -1.565827  0.262419
Oregon -0.722967  1.806119

Element-wise Python functions can be used, too. Suppose you wanted to compute a
formatted string from each floating-point value in frame. You can do this with apply
map:

In [182]:
format= lambda x: '%.2f' % x

In [183]:
frame.applymap(format)

            b      d      e
Utah    -0.58   0.17  -2.53
Ohio     1.36  -1.76  -0.91
Texas    0.26  -1.57   0.14
Oregon   0.69   1.81  -0.72

The reason for the name applymap is that Series has a map method for applying an
element-wise function:

In [184]:
frame['e'].map(format)

Utah      -2.53
Ohio      -0.91
Texas      0.14
Oregon    -0.72
Name: e, dtype: object

## Sorting and ranking
Sorting a dataset by some criterion is another important built-in operation. To sort
lexicographically by row or column index, use the `sort_index` method, which returns
a new, sorted object:

In [185]:
obj=Series(range(4), index=list('dabc'))
obj

d    0
a    1
b    2
c    3
dtype: int64

In [186]:
obj.sort_index() #sort by row or column index

a    1
b    2
c    3
d    0
dtype: int64

With a DataFrame, you can sort by index on either axis:

In [187]:
frame=DataFrame(np.arange(8.).reshape((2,4)), index=['Three','One'],
               columns=list('dabc'))
frame

         d    a    b    c
Three  0.0  1.0  2.0  3.0
One    4.0  5.0  6.0  7.0

In [188]:
frame.sort_index() #按照行索引排序

         d    a    b    c
One    4.0  5.0  6.0  7.0
Three  0.0  1.0  2.0  3.0

In [189]:
frame.sort_index(axis=1) #按照列索引排序

         a    b    c    d
Three  1.0  2.0  3.0  0.0
One    5.0  6.0  7.0  4.0

The data is sorted in ascending order by default. Sorting be descending order by setting parameter ascending=False

In [190]:
frame.sort_index(axis=1, ascending=False)

         d    c    b    a
Three  0.0  3.0  2.0  1.0
One    4.0  7.0  6.0  5.0

To sort a Series by its values, use its `sort_values` method:

In [191]:
obj=Series([4,7,-3,2])
obj

0    4
1    7
2   -3
3    2
dtype: int64

In [192]:
obj.sort_values()

2   -3
3    2
0    4
1    7
dtype: int64

In [193]:
obj=Series([4,np.nan, 7, np.nan, -3,2])
obj

0    4.0
1    NaN
2    7.0
3    NaN
4   -3.0
5    2.0
dtype: float64

In [194]:
obj.sort_values()

4   -3.0
5    2.0
0    4.0
2    7.0
1    NaN
3    NaN
dtype: float64

When sorting a DataFrame, you can use the data in one or more columns as the sort
keys. To do so, pass one or more column names to the `by` option of sort_values:

In [195]:
frame=DataFrame({'b':[4,7,-3,2],'a':[0,1,0,1]})
frame

   b  a
0  4  0
1  7  1
2 -3  0
3  2  1

In [196]:
frame.sort_values(by='b')

   b  a
2 -3  0
3  2  1
0  4  0
1  7  1

In [197]:
frame.sort_values(by=['a','b'])

   b  a
2 -3  0
0  4  0
3  2  1
1  7  1

#### Ranking
Assigning ranks from one through the number of valid data points in an array. It is similar to the indirect sort indices produced by numpy.argsort.

In [198]:
obj=Series([7,-5,7,4,2,0,4])
obj

0    7
1   -5
2    7
3    4
4    2
5    0
6    4
dtype: int64

In [199]:
obj.rank()

0    6.5
1    1.0
2    6.5
3    4.5
4    3.0
5    2.0
6    4.5
dtype: float64

Ranks can also be assigned according to the order in which they’re observed in the
data:

In [200]:
obj.rank(method='first')

0    6.0
1    1.0
2    7.0
3    4.0
4    3.0
5    2.0
6    5.0
dtype: float64

In [201]:
obj.rank(ascending=False, method='max')

0    2.0
1    7.0
2    2.0
3    4.0
4    5.0
5    6.0
6    4.0
dtype: float64

In [202]:
frame=DataFrame({'b':[4.3,7,-3,2], 'a':[0,1,0,1],
                'c':[-2,5,8,-2.5]})
frame

     b  a    c
0  4.3  0 -2.0
1  7.0  1  5.0
2 -3.0  0  8.0
3  2.0  1 -2.5

In [203]:
frame.rank(axis=1)

     b    a    c
0  3.0  2.0  1.0
1  3.0  1.0  2.0
2  1.0  2.0  3.0
3  3.0  2.0  1.0

### Axis indexes with duplicate values

In [204]:
obj=Series(np.arange(5), index=list('aabbc'))
obj

a    0
a    1
b    2
b    3
c    4
dtype: int64

The index's is_unique property can tell you whether its values are unique or not

In [205]:
obj.index.is_unique #行索引 是否唯一 判断

False

In [206]:
obj['a']

a    0
a    1
dtype: int64

In [207]:
df=DataFrame(np.random.randn(4,3), index=list('aabb'))
df

          0         1         2
a -0.013661  1.815655 -0.251980
a  0.574857  0.300252 -0.190661
b  1.441923 -0.774977  1.075733
b  0.312097  1.142985 -1.083875

In [208]:
df.loc['b']

          0         1         2
b  1.441923 -0.774977  1.075733
b  0.312097  1.142985 -1.083875

## Summarizing and Computing Descriptive Statistics
<font color=red>Pandas methods are built from the ground up to exclude missing data.</font>

In [209]:
df=DataFrame([[1.4,np.nan],[7.1,-4.5],
            [np.nan,np.nan],[0.75,-1.3]],
            index=list('abcd'),
            columns=['One','Two'])
df

    One  Two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [210]:
df.sum() #Calling DataFrame's sum method returns a Series containing columns sums默认按列求和

One    9.25
Two   -5.80
dtype: float64

In [211]:
df.sum(axis=1)# 按行求和

a    1.40
b    2.60
c    0.00
d   -0.55
dtype: float64

In [212]:
df.mean(axis=1, skipna=False)

a      NaN
b    1.300
c      NaN
d   -0.275
dtype: float64

Some methods, like `idxmin` and `idxmax`, return indirect statistics like the index value
where the minimum or maximum values are attained:

In [213]:
df.idxmax()

One    b
Two    d
dtype: object

In [214]:
df.idxmin()

One    d
Two    b
dtype: object

In [215]:
df.cumsum() #按列累积求和

    One  Two
a  1.40  NaN
b  8.50 -4.5
c   NaN  NaN
d  9.25 -5.8

In [216]:
df.describe()

            One       Two
count  3.000000  2.000000
mean   3.083333 -2.900000
std    3.493685  2.262742
min    0.750000 -4.500000
25%    1.075000 -3.700000
50%    1.400000 -2.900000
75%    4.250000 -2.100000
max    7.100000 -1.300000

### Correlation and Covariance

In [217]:
import pandas_datareader.data as web

In [218]:
all_data={}
for ticker in ['AAPL','IBM','MSFT','GOOG']:
    all_data[ticker]=web.get_data_yahoo(ticker, '1/1/2000','1/1/2010')

In [219]:
all_data

{'AAPL':                  High        Low       Open      Close       Volume  Adj Close
 Date
 2000-01-03   4.017857   3.631696   3.745536   3.997768  133949200.0   2.665724
 2000-01-04   3.950893   3.613839   3.866071   3.660714  128094400.0   2.440975
 2000-01-05   3.948661   3.678571   3.705357   3.714286  194580400.0   2.476697
 2000-01-06   3.821429   3.392857   3.790179   3.392857  191993200.0   2.262367
 2000-01-07   3.607143   3.410714   3.446429   3.553571  115183600.0   2.369532
 2000-01-10   3.651786   3.383929   3.642857   3.491071  126266000.0   2.327857
 2000-01-11   3.549107   3.232143   3.426339   3.312500  110387200.0   2.208785
 2000-01-12   3.410714   3.089286   3.392857   3.113839  244017200.0   2.076318
 2000-01-13   3.526786   3.303571   3.374439   3.455357  258171200.0   2.304043
 2000-01-14   3.651786   3.549107   3.571429   3.587054   97594000.0   2.391858
 2000-01-18   3.785714   3.587054   3.607143   3.712054  114794400.0   2.475209
 2000-01-19   3.883929   3.691964   3.772321   3.805804  149410800.0   2.537721
 2000-01-20   4.339286   4.053571   4.125000   4.053571  457783200.0   2.702933
 2000-01-21   4.080357   3.935268   4.080357   3.975446  123981200.0   2.650840
 2000-01-24   4.026786   3.754464   3.872768   3.794643  110219200.0   2.530279
 2000-01-25   4.040179   3.656250   3.750000   4.008929  124286400.0   2.673166
 2000-01-26   4.078125   3.919643   3.928571   3.935268   91789600.0   2.624048
 2000-01-27   4.035714   3.821429   3.886161   3.928571   85036000.0   2.619583
 2000-01-28   3.959821   3.593750   3.863839   3.629464  105837200.0   2.420138
 2000-01-31   3.709821   3.375000   3.607143   3.705357  175420000.0   2.470743
 2000-02-01   3.750000   3.571429   3.714286   3.580357   79508800.0   2.387393
 2000-02-02   3.647321   3.464286   3.598214   3.529018  116048800.0   2.353160
 2000-02-03   3.723214   3.580357   3.582589   3.689732  118798400.0   2.460325
 2000-02-04   3.928571   3.700893   3.712054   3.857143  106330000.0   2.571954
 2000-02-07   4.080357   3.783482   3.857143   4.073661  110266800.0   2.716329
 2000-02-08   4.147321   3.973214   4.071429   4.102679  102160800.0   2.735678
 2000-02-09   4.183036   4.015625   4.075893   4.022321   74841200.0   2.682096
 2000-02-10   4.066964   3.928571   4.031250   4.053571   75745600.0   2.702933
 2000-02-11   4.075893   3.866071   4.058036   3.883929   53062800.0   2.589815
 2000-02-14   4.138393   3.879464   3.904018   4.136161   91884800.0   2.758004
 ...               ...        ...        ...        ...          ...        ...
 2009-11-18  29.571428  29.142857  29.505714  29.422857   93580200.0  19.619249
 2009-11-19  29.230000  28.542856  29.230000  28.644285  135581600.0  19.100094
 2009-11-20  28.627142  28.251429  28.450001  28.559999  101666600.0  19.043890
 2009-11-23  29.428572  28.992857  29.000000  29.411428  118724200.0  19.611629
 2009-11-24  29.411428  28.985714  29.332857  29.205715   79609600.0  19.474459
 2009-11-25  29.378571  29.108572  29.342857  29.170000   71613500.0  19.450645
 2009-11-27  28.994286  28.338572  28.459999  28.655714   73814300.0  19.107714
 2009-11-30  28.811428  28.395714  28.730000  28.558571  106214500.0  19.042934
 2009-12-01  28.967142  28.118572  28.891428  28.138571  116440800.0  18.762886
 2009-12-02  28.774286  27.964285  28.422857  28.032858  178815000.0  18.692392
 2009-12-03  28.425714  28.038572  28.202858  28.068571  112179900.0  18.716209
 2009-12-04  28.554285  27.182858  28.528572  27.617144  206721200.0  18.415195
 2009-12-07  27.681429  26.954287  27.617144  26.992857  178689700.0  17.998917
 2009-12-08  27.478571  26.957144  27.051428  27.124287  172599700.0  18.086554
 2009-12-09  28.308571  27.187143  27.325714  28.257143  171195500.0  18.841948
 2009-12-10  28.528572  28.017143  28.500000  28.061428  122417400.0  18.711447
 2009-12-11  28.285715  27.632856  28.254286  27.809999  107443700.0  18.543785
 2009-12-14  28.204287  27.508572  27.910000  28.139999  123947600.0  18.763832
 2009-12-15  28.215714  27.610001  27.975714  27.738571  104864900.0  18.496168
 2009-12-16  28.071428  27.792856  27.871429  27.861429   88246200.0  18.578085
 2009-12-17  27.857143  27.285715  27.751429  27.408571   97209700.0  18.276117
 2009-12-18  27.928572  27.514286  27.595715  27.918571  152192600.0  18.616186
 2009-12-21  28.535715  27.952858  28.007143  28.318571  152976600.0  18.882910
 2009-12-22  28.692858  28.379999  28.491428  28.622858   87378900.0  19.085808
 2009-12-23  28.911428  28.687143  28.742857  28.871429   86381400.0  19.251556
 2009-12-24  29.907143  29.049999  29.078571  29.862858  125222300.0  19.912643
 2009-12-28  30.564285  29.944286  30.245714  30.230000  161141400.0  20.157457
 2009-12-29  30.388571  29.818571  30.375713  29.871429  111301400.0  19.918360
 2009-12-30  30.285715  29.758572  29.832857  30.234285  103021100.0  20.160311
 2009-12-31  30.478571  30.080000  30.447144  30.104286   88102700.0  20.073631

 [2515 rows x 6 columns],
 'IBM':                   High         Low        Open       Close      Volume  \
 Date
 2000-01-03  116.000000  111.875000  112.437500  116.000000  10347700.0
 2000-01-04  114.500000  110.875000  114.000000  112.062500   8227800.0
 2000-01-05  119.750000  112.125000  112.937500  116.000000  12733200.0
 2000-01-06  118.937500  113.500000  118.000000  114.000000   7971900.0
 2000-01-07  117.937500  110.625000  117.250000  113.500000  11856700.0
 2000-01-10  119.375000  115.375000  117.250000  118.000000   8540500.0
 2000-01-11  121.125000  116.625000  117.875000  119.000000   7873300.0
 2000-01-12  122.000000  118.250000  119.625000  119.500000   6803800.0
 2000-01-13  121.000000  115.750000  119.937500  118.250000   8489700.0
 2000-01-14  123.312500  117.500000  120.937500  119.625000  10956600.0
 2000-01-18  119.750000  115.000000  119.687500  115.750000   7643900.0
 2000-01-19  122.000000  112.687500  115.562500  119.500000   8634500.0
 2000-01-20  124.750000  119.000000  123.000000  119.000000  17783400.0
 2000-01-21  123.000000  119.937500  121.875000  121.500000   7868700.0
 2000-01-24  122.875000  116.562500  121.875000  121.500000   6499200.0
 2000-01-25  119.500000  116.000000  116.750000  119.125000   6936900.0
 2000-01-26  119.937500  116.000000  119.062500  116.750000   4895100.0
 2000-01-27  118.437500  111.625000  118.000000  113.500000   8324600.0
 2000-01-28  114.187500  110.062500  112.750000  111.562500   6669400.0
 2000-01-31  112.812500  109.625000  111.375000  112.250000   6202700.0
 2000-02-01  113.437500  109.125000  112.375000  110.000000   7304700.0
 2000-02-02  115.812500  110.375000  112.000000  113.500000   7707700.0
 2000-02-03  117.500000  114.062500  115.000000  117.125000   6213800.0
 2000-02-04  118.437500  114.812500  118.187500  115.625000   5405300.0
 2000-02-07  116.875000  113.125000  116.000000  114.125000   5779500.0
 2000-02-08  119.000000  116.187500  116.937500  118.812500   5464300.0
 2000-02-09  119.750000  117.000000  119.000000  117.375000   5374700.0
 2000-02-10  119.125000  116.875000  117.687500  119.125000   4446600.0
 2000-02-11  119.437500  114.562500  119.062500  115.375000   5749400.0
 2000-02-14  116.375000  114.500000  116.000000  116.062500   4544000.0
 ...                ...         ...         ...         ...         ...
 2009-11-18  128.350006  127.550003  128.050003  128.149994   3970100.0
 2009-11-19  127.839996  126.510002  127.279999  127.540001   5308400.0
 2009-11-20  127.690002  126.459999  127.169998  126.959999   5354200.0
 2009-11-23  128.940002  127.650002  127.699997  128.199997   7003500.0
 2009-11-24  128.320007  127.139999  127.900002  127.930000   4816500.0
 2009-11-25  128.220001  127.080002  127.879997  127.279999   3967700.0
 2009-11-27  126.620003  124.260002  124.589996  125.699997   3319200.0
 2009-11-30  126.599998  124.919998  125.120003  126.349998   6302700.0
 2009-12-01  128.389999  126.849998  127.290001  127.940002   6578600.0
 2009-12-02  128.389999  127.160004  127.320000  127.209999   4597900.0
 2009-12-03  128.470001  127.250000  127.599998  127.550003   5760000.0
 2009-12-04  128.899994  126.000000  128.399994  127.250000   7068500.0
 2009-12-07  127.529999  126.589996  126.879997  127.040001   4144400.0
 2009-12-08  127.349998  126.160004  126.970001  126.800003   5351400.0
 2009-12-09  128.389999  126.110001  126.699997  128.389999   6071900.0
 2009-12-10  129.470001  128.089996  128.130005  129.339996   7077800.0
 2009-12-11  129.770004  128.710007  129.009995  129.679993   6597200.0
 2009-12-14  129.979996  129.600006  129.649994  129.929993   5201300.0
 2009-12-15  129.860001  127.940002  129.460007  128.490005   7862600.0
 2009-12-16  129.600006  128.350006  128.740005  128.710007   6372500.0
 2009-12-17  128.559998  127.120003  128.000000  127.400002   5909500.0
 2009-12-18  128.389999  127.000000  127.970001  127.910004   9106600.0
 2009-12-21  128.940002  127.680000  127.800003  128.649994   4772500.0
 2009-12-22  129.979996  129.190002  129.300003  129.929993   5535500.0
 2009-12-23  130.000000  129.300003  129.699997  130.000000   4127600.0
 2009-12-24  130.570007  129.479996  129.889999  130.570007   4265100.0
 2009-12-28  132.309998  130.720001  130.990005  132.309998   5800400.0
 2009-12-29  132.369995  131.800003  132.279999  131.850006   4184200.0
 2009-12-30  132.679993  130.679993  131.229996  132.570007   3867000.0
 2009-12-31  132.850006  130.750000  132.410004  130.899994   4223400.0

              Adj Close
 Date
 2000-01-03   79.153915
 2000-01-04   76.467079
 2000-01-05   79.153915
 2000-01-06   77.789200
 2000-01-07   77.448021
 2000-01-10   80.518608
 2000-01-11   81.200981
 2000-01-12   81.542168
 2000-01-13   80.689217
 2000-01-14   81.627472
 2000-01-18   78.983299
 2000-01-19   81.542168
 2000-01-20   81.200981
 2000-01-21   82.906891
 2000-01-24   82.906891
 2000-01-25   81.286270
 2000-01-26   79.665695
 2000-01-27   77.448021
 2000-01-28   76.125916
 2000-01-31   76.595032
 2000-02-01   75.059723
 2000-02-02   77.448021
 2000-02-03   79.921555
 2000-02-04   78.898003
 2000-02-07   77.874474
 2000-02-08   81.158409
 2000-02-09   80.176445
 2000-02-10   81.371849
 2000-02-11   78.810295
 2000-02-14   79.279922
 ...                ...
 2009-11-18   97.216805
 2009-11-19   96.754074
 2009-11-20   96.314056
 2009-11-23   97.254768
 2009-11-24   97.049911
 2009-11-25   96.556824
 2009-11-27   95.358200
 2009-11-30   95.851318
 2009-12-01   97.057518
 2009-12-02   96.503723
 2009-12-03   96.761681
 2009-12-04   96.534065
 2009-12-07   96.374763
 2009-12-08   96.192688
 2009-12-09   97.398895
 2009-12-10   98.119583
 2009-12-11   98.377510
 2009-12-14   98.567169
 2009-12-15   97.474777
 2009-12-16   97.641640
 2009-12-17   96.647858
 2009-12-18   97.034767
 2009-12-21   97.596107
 2009-12-22   98.567169
 2009-12-23   98.620255
 2009-12-24   99.052696
 2009-12-28  100.372673
 2009-12-29  100.023689
 2009-12-30  100.569916
 2009-12-31   99.303009

 [2515 rows x 6 columns],
 'MSFT':                  High        Low       Open      Close       Volume  Adj Close
 Date
 2000-01-03  59.312500  56.000000  58.687500  58.281250   53228400.0  42.295185
 2000-01-04  58.562500  56.125000  56.781250  56.312500   54119000.0  40.866425
 2000-01-05  58.187500  54.687500  55.562500  56.906250   64059600.0  41.297348
 2000-01-06  56.937500  54.187500  56.093750  55.000000   54976600.0  39.913952
 2000-01-07  56.125000  53.656250  54.312500  55.718750   62013600.0  40.435547
 2000-01-10  56.843750  55.687500  56.718750  56.125000   44963600.0  40.730385
 2000-01-11  57.125000  54.343750  55.750000  54.687500   46743600.0  39.687164
 2000-01-12  54.437500  52.218750  54.250000  52.906250   66532400.0  38.394501
 2000-01-13  54.312500  50.750000  52.187500  53.906250   83144000.0  39.120216
 2000-01-14  56.968750  52.875000  53.593750  56.125000   73416400.0  40.730385
 2000-01-18  58.250000  55.875000  55.906250  57.656250   81483600.0  41.841614
 2000-01-19  55.750000  53.000000  55.250000  53.500000   97568200.0  38.825386
 2000-01-20  54.843750  52.937500  53.531250  53.000000   56349800.0  38.462540
 2000-01-21  53.625000  51.625000  53.500000  51.875000   68416200.0  37.646118
 2000-01-24  52.843750  50.406250  51.898399  50.625000   63597600.0  36.738991
 2000-01-25  51.937500  49.781250  50.500000  51.406250   59823200.0  37.305939
 2000-01-26  51.750000  49.562500  51.218750  49.687500   49365000.0  36.058632
 2000-01-27  50.593750  48.625000  49.945301  49.375000   63654800.0  35.831844
 2000-01-28  50.125000  48.625000  49.062500  49.125000   58225400.0  35.650417
 2000-01-31  49.093750  47.437500  48.812500  48.937500   73194200.0  35.514324
 2000-02-01  51.625000  48.843750  49.250000  51.468750   70196600.0  37.351295
 2000-02-02  51.968750  50.250000  51.218750  50.406250   49915600.0  36.580242
 2000-02-03  52.093750  50.062500  51.031250  51.812500   49186000.0  37.600739
 2000-02-04  54.000000  52.070301  52.187500  53.281250   55365400.0  38.666641
 2000-02-07  53.437500  52.125000  53.406250  53.312500   40005800.0  38.689304
 2000-02-08  55.000000  53.218750  53.218750  54.968750   56229000.0  39.891277
 2000-02-09  54.718750  51.937500  54.718750  52.000000   55090000.0  37.736809
 2000-02-10  53.281250  51.250000  51.945301  53.000000   54527800.0  38.462540
 2000-02-11  52.437500  49.562500  52.437500  49.968750  115559000.0  36.262733
 2000-02-14  50.875000  49.531250  50.617149  49.812500   81028600.0  36.149353
 ...               ...        ...        ...        ...          ...        ...
 2009-11-18  30.139999  29.809999  30.000000  30.110001   59431200.0  24.049988
 2009-11-19  30.000000  29.700001  29.990000  29.780001   51967700.0  23.786396
 2009-11-20  29.770000  29.430000  29.660000  29.620001   42647100.0  23.658604
 2009-11-23  30.010000  29.700001  29.840000  29.940001   41832700.0  23.914200
 2009-11-24  29.990000  29.750000  29.950001  29.910000   37341400.0  23.890238
 2009-11-25  29.860001  29.580000  29.809999  29.790001   32033500.0  23.794392
 2009-11-27  29.389999  28.750000  29.110001  29.219999   29357900.0  23.339111
 2009-11-30  29.450001  29.000000  29.150000  29.410000   44172000.0  23.490871
 2009-12-01  30.049999  29.410000  29.520000  30.010000   49904200.0  23.970112
 2009-12-02  29.990000  29.650000  29.900000  29.780001   36308600.0  23.786396
 2009-12-03  30.200001  29.760000  29.840000  29.830000   43095200.0  23.826334
 2009-12-04  30.370001  29.830000  30.049999  29.980000   58810700.0  23.946159
 2009-12-07  30.080000  29.680000  29.780001  29.790001   38082700.0  23.794392
 2009-12-08  29.740000  29.379999  29.520000  29.570000   37402200.0  23.618668
 2009-12-09  29.809999  29.250000  29.469999  29.709999   44713300.0  23.730490
 2009-12-10  29.959999  29.660000  29.709999  29.870001   45940200.0  23.858290
 2009-12-11  30.000000  29.790001  29.969999  29.850000   43744200.0  23.842314
 2009-12-14  30.160000  29.900000  29.910000  30.110001   34651200.0  24.049988
 2009-12-15  30.209999  29.879999  29.889999  30.020000   49473200.0  23.978096
 2009-12-16  30.410000  30.040001  30.070000  30.100000   55737800.0  24.041994
 2009-12-17  29.959999  29.570000  29.950001  29.600000   43691200.0  23.642628
 2009-12-18  30.450001  29.799999  29.840000  30.360001   94118000.0  24.249668
 2009-12-21  30.840000  30.370001  30.400000  30.520000   40129100.0  24.377472
 2009-12-22  30.930000  30.540001  30.600000  30.820000   36321000.0  24.617090
 2009-12-23  30.950001  30.690001  30.709999  30.920000   28362700.0  24.696962
 2009-12-24  31.000000  30.760000  30.879999  31.000000   11083900.0  24.760857
 2009-12-28  31.180000  30.889999  31.000000  31.170000   25384000.0  24.896641
 2009-12-29  31.500000  31.230000  31.350000  31.389999   29716200.0  25.072367
 2009-12-30  31.290001  30.799999  31.150000  30.959999   42006200.0  24.728914
 2009-12-31  30.990000  30.480000  30.980000  30.480000   31929700.0  24.345514

 [2515 rows x 6 columns],
 'GOOG':                   High         Low        Open       Close    Volume  \
 Date
 2004-08-19   51.693783   47.669952   49.676899   49.845802  44994500
 2004-08-20   54.187561   49.925285   50.178635   53.805050  23005800
 2004-08-23   56.373344   54.172661   55.017166   54.346527  18393200
 2004-08-24   55.439419   51.450363   55.260582   52.096165  15361800
 2004-08-25   53.651051   51.604362   52.140873   52.657513   9257400
 2004-08-26   53.626213   51.991844   52.135906   53.606342   7148200
 2004-08-27   53.959049   52.503513   53.700729   52.732029   6258300
 2004-08-30   52.404160   50.675404   52.299839   50.675404   5235700
 2004-08-31   51.519913   50.749920   50.819469   50.854240   4954800
 2004-09-01   51.152302   49.512966   51.018177   49.801090   9206800
 2004-09-02   50.854240   49.150326   49.274517   50.427021  15232100
 2004-09-03   50.541279   49.339096   50.148830   49.681866   5191000
 2004-09-07   50.670437   49.483158   50.178635   50.461796   5891300
 2004-09-08   51.182110   49.925285   50.044510   50.819469   5023000
 2004-09-09   51.023144   50.173668   50.933723   50.824436   4092100
 2004-09-10   52.935703   50.322701   50.471729   52.324677   8764200
 2004-09-13   53.854729   52.886028   52.970478   53.402668   7902900
 2004-09-14   55.638126   53.049961   53.377831   55.384777  10910200
 2004-09-15   56.745922   54.743942   54.922779   55.638126  10793500
 2004-09-16   57.525848   55.464260   55.807030   56.616764   9335800
 2004-09-17   58.365391   56.408119   56.840309   58.365391   9543500
 2004-09-20   60.407108   58.007717   58.097134   59.294346  10708500
 2004-09-21   59.820923   58.375324   59.517895   58.539257   7282900
 2004-09-22   59.448345   58.027588   58.320679   58.807514   7638000
 2004-09-23   60.918781   58.131908   59.036026   60.019630   8599600
 2004-09-24   61.649033   59.493053   60.079243   59.527828   9191900
 2004-09-27   60.049435   58.519386   59.393700   58.747902   7119100
 2004-09-28   63.288372   59.716602   60.258080   63.020115  17056100
 2004-09-29   67.073753   62.707150   62.940632   65.116478  30745600
 2004-09-30   65.722542   64.083199   64.530296   64.381264  13861300
 ...                ...         ...         ...         ...       ...
 2009-11-18  287.519958  284.186646  286.461853  286.461853   3119200
 2009-11-19  285.145416  283.158325  285.031158  284.643677   4364100
 2009-11-20  283.953156  282.860260  282.909943  283.138458   4038500
 2009-11-23  291.404694  286.069397  286.382355  289.293427   5128000
 2009-11-24  290.257172  286.407196  289.377869  289.661041   3231200
 2009-11-25  291.633209  289.462341  291.310303  290.977478   2941400
 2009-11-27  289.348083  283.640198  284.151855  288.006805   2787100
 2009-11-30  289.949158  286.690369  288.438995  289.616333   3472500
 2009-12-01  293.699768  289.616333  292.164764  293.029114   4670700
 2009-12-02  294.588989  291.215912  293.590485  291.856750   3348000
 2009-12-03  293.814026  290.609863  292.616821  290.977478   2875900
 2009-12-04  295.493103  287.718658  294.593964  290.614838   5059900
 2009-12-07  292.442932  288.622772  290.217407  291.230835   3293500
 2009-12-08  293.421570  289.119568  289.864716  291.628235   3067700
 2009-12-09  292.760864  289.904449  291.851776  292.606873   3585000
 2009-12-10  295.433502  293.297394  293.312286  293.838867   3358200
 2009-12-11  295.453369  291.966034  295.418579  293.347046   3462300
 2009-12-14  296.725098  294.390289  295.751434  295.940186   3851600
 2009-12-15  296.263092  293.585510  294.733032  294.653564   4590400
 2009-12-16  298.245209  296.392242  297.365936  296.948639   5655300
 2009-12-17  296.889038  294.961548  296.292908  295.050964   5311800
 2009-12-18  297.529846  295.577545  296.089233  296.282959   7108900
 2009-12-21  297.981903  295.910400  296.874115  297.405670   5175800
 2009-12-22  298.806549  297.490112  298.727081  298.617767   3786000

In [220]:
price=DataFrame({tic:data['Adj Close']
                for tic, data in all_data.items()})

In [221]:
volume=DataFrame({tic: data['Volume']
                 for tic, data in all_data.items()})

In [222]:
price

                 AAPL         IBM       MSFT        GOOG
Date
2000-01-03   2.665724   79.153915  42.295185         NaN
2000-01-04   2.440975   76.467079  40.866425         NaN
2000-01-05   2.476697   79.153915  41.297348         NaN
2000-01-06   2.262367   77.789200  39.913952         NaN
2000-01-07   2.369532   77.448021  40.435547         NaN
2000-01-10   2.327857   80.518608  40.730385         NaN
2000-01-11   2.208785   81.200981  39.687164         NaN
2000-01-12   2.076318   81.542168  38.394501         NaN
2000-01-13   2.304043   80.689217  39.120216         NaN
2000-01-14   2.391858   81.627472  40.730385         NaN
2000-01-18   2.475209   78.983299  41.841614         NaN
2000-01-19   2.537721   81.542168  38.825386         NaN
2000-01-20   2.702933   81.200981  38.462540         NaN
2000-01-21   2.650840   82.906891  37.646118         NaN
2000-01-24   2.530279   82.906891  36.738991         NaN
2000-01-25   2.673166   81.286270  37.305939         NaN
2000-01-26   2.624048   79.665695  36.058632         NaN
2000-01-27   2.619583   77.448021  35.831844         NaN
2000-01-28   2.420138   76.125916  35.650417         NaN
2000-01-31   2.470743   76.595032  35.514324         NaN
2000-02-01   2.387393   75.059723  37.351295         NaN
2000-02-02   2.353160   77.448021  36.580242         NaN
2000-02-03   2.460325   79.921555  37.600739         NaN
2000-02-04   2.571954   78.898003  38.666641         NaN
2000-02-07   2.716329   77.874474  38.689304         NaN
2000-02-08   2.735678   81.158409  39.891277         NaN
2000-02-09   2.682096   80.176445  37.736809         NaN
2000-02-10   2.702933   81.371849  38.462540         NaN
2000-02-11   2.589815   78.810295  36.262733         NaN
2000-02-14   2.758004   79.279922  36.149353         NaN
...               ...         ...        ...         ...
2009-11-18  19.619249   97.216805  24.049988  286.461853
2009-11-19  19.100094   96.754074  23.786396  284.643677
2009-11-20  19.043890   96.314056  23.658604  283.138458
2009-11-23  19.611629   97.254768  23.914200  289.293427
2009-11-24  19.474459   97.049911  23.890238  289.661041
2009-11-25  19.450645   96.556824  23.794392  290.977478
2009-11-27  19.107714   95.358200  23.339111  288.006805
2009-11-30  19.042934   95.851318  23.490871  289.616333
2009-12-01  18.762886   97.057518  23.970112  293.029114
2009-12-02  18.692392   96.503723  23.786396  291.856750
2009-12-03  18.716209   96.761681  23.826334  290.977478
2009-12-04  18.415195   96.534065  23.946159  290.614838
2009-12-07  17.998917   96.374763  23.794392  291.230835
2009-12-08  18.086554   96.192688  23.618668  291.628235
2009-12-09  18.841948   97.398895  23.730490  292.606873
2009-12-10  18.711447   98.119583  23.858290  293.838867
2009-12-11  18.543785   98.377510  23.842314  293.347046
2009-12-14  18.763832   98.567169  24.049988  295.940186
2009-12-15  18.496168   97.474777  23.978096  294.653564
2009-12-16  18.578085   97.641640  24.041994  296.948639
2009-12-17  18.276117   96.647858  23.642628  295.050964
2009-12-18  18.616186   97.034767  24.249668  296.282959
2009-12-21  18.882910   97.596107  24.377472  297.405670
2009-12-22  19.085808   98.567169  24.617090  298.617767
2009-12-23  19.251556   98.620255  24.696962  303.863647
2009-12-24  19.912643   99.052696  24.760857  307.241699
2009-12-28  20.157457  100.372673  24.896641  309.422516
2009-12-29  19.918360  100.023689  25.072367  307.698730
2009-12-30  20.160311  100.569916  24.728914  309.352966
2009-12-31  20.073631   99.303009  24.345514  307.986847

[2515 rows x 4 columns]

In [223]:
returns=price.pct_change() #Percentage change between the current and a prior element.

In [224]:
returns.tail()

                AAPL       IBM      MSFT      GOOG
Date
2009-12-24  0.034339  0.004385  0.002587  0.011117
2009-12-28  0.012294  0.013326  0.005484  0.007098
2009-12-29 -0.011861 -0.003477  0.007058 -0.005571
2009-12-30  0.012147  0.005461 -0.013698  0.005376
2009-12-31 -0.004300 -0.012597 -0.015504 -0.004416

In [225]:
returns.MSFT.corr(returns.IBM)

0.49414967814095245

In [226]:
returns.MSFT.cov(returns.IBM)

0.0002157125382430134

In [227]:
returns.corr()

          AAPL       IBM      MSFT      GOOG
AAPL  1.000000  0.410011  0.423556  0.470676
IBM   0.410011  1.000000  0.494150  0.390689
MSFT  0.423556  0.494150  1.000000  0.438313
GOOG  0.470676  0.390689  0.438313  1.000000

In [228]:
returns.cov()

          AAPL       IBM      MSFT      GOOG
AAPL  0.001027  0.000252  0.000309  0.000303
IBM   0.000252  0.000367  0.000216  0.000142
MSFT  0.000309  0.000216  0.000519  0.000204
GOOG  0.000303  0.000142  0.000204  0.000580

Using DataFrame’s `corrwith` method, you can compute pairwise correlations
between a DataFrame’s columns or rows with another Series or DataFrame. Passing a
Series returns a Series with the correlation value computed for each column:

In [229]:
returns.corrwith(returns.IBM)

AAPL    0.410011
IBM     1.000000
MSFT    0.494150
GOOG    0.390689
dtype: float64

## Unique Values, Value Counts, and Membership

In [230]:
obj=Series(list('cadaabbcc'))
obj

0    c
1    a
2    d
3    a
4    a
5    b
6    b
7    c
8    c
dtype: object

In [231]:
uniques=obj.unique()

In [232]:
uniques

array(['c', 'a', 'd', 'b'], dtype=object)

In [233]:
obj.value_counts()

a    3
c    3
b    2
d    1
dtype: int64

In [234]:
pd.value_counts(obj.values, sort=False) #sort =False 按索引顺序排列

d    1
c    3
a    3
b    2
dtype: int64

In [235]:
mask=obj.isin(['b','c'])

In [236]:
mask

0     True
1    False
2    False
3    False
4    False
5     True
6     True
7     True
8     True
dtype: bool

In [237]:
obj[mask]

0    c
5    b
6    b
7    c
8    c
dtype: object

In [238]:
data=DataFrame({'Qu1':[1,3,4,3,4],
               'Qu2':[2,3,1,2,3],
               'Qu3':[1,5,2,4,4]})
data

   Qu1  Qu2  Qu3
0    1    2    1
1    3    3    5
2    4    1    2
3    3    2    4
4    4    3    4

Passing `pandas.value_counts` to this DataFrame’s `apply` function gives:

In [239]:
result=data.apply(pd.value_counts).fillna(0)

In [240]:
result

   Qu1  Qu2  Qu3
1  1.0  1.0  1.0
2  0.0  2.0  1.0
3  2.0  2.0  0.0
4  2.0  0.0  2.0
5  0.0  0.0  1.0